In [ ]:
## Importing pandas library
import pandas as pd

In [2]:
test_data = [["Manish", 98, "Male"], ["Ram", 99, "Male"], ["Sita", 100, "Female"]]

## creating dataframe
df = pd.DataFrame(test_data, columns=["Name", "Age", "Gender"])
print(df)

     Name  Age  Gender
0  Manish   98    Male
1     Ram   99    Male
2    Sita  100  Female

In [ ]:
test_data2 = {"Name":["Manish", "Ram", "Sita"],
              "Marks":[98, 99, 100],
              "Gender":["Male", "Male", "Female"]}

##custom index
df = pd.DataFrame(test_data2, index=["first", "second", "third"])
df

          Name  Marks  Gender
first   Manish     98    Male
second     Ram     99    Male
third     Sita    100  Female

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, first to third
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Marks   3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [ ]:
## displaying a specific column as a dataframe
df[["Name"]]

          Name
first   Manish
second     Ram
third     Sita

In [8]:
## display data with conditions
df[df["Marks"]>98]

        Name  Marks  Gender
second   Ram     99    Male
third   Sita    100  Female

In [11]:
test_data3 = {"Name":["Manish", "Ram", "Sita", "Gita"],
              "Salary":[98000, 99000, 50000, 60000],
              "Age": [20, 22, 23, 21],
              "Gender":["Male", "Male", "Female", "Female"]}

df = pd.DataFrame(test_data3)

In [12]:
## adding new column
df["Bonus"] = df["Salary"] * 0.15

## changing data using loc
df.loc[df["Name"] == "Manish", "Salary"] = 95000
df

     Name  Salary  Age  Gender    Bonus
0  Manish   95000   20    Male  14700.0
1     Ram   99000   22    Male  14850.0
2    Sita   50000   23  Female   7500.0
3    Gita   60000   21  Female   9000.0

In [16]:
## drop the column
df.drop("Bonus", axis=1, inplace=True)

## drop the row
df.drop(0, axis=0, inplace=True)

df

   Name  Salary  Age  Gender
1   Ram   99000   22    Male
2  Sita   50000   23  Female
3  Gita   60000   21  Female